
# Задание task_02_24.
#
# Выполнил: Фамилия И.О.
# Группа: !!!



n = # Удалите комментарий и допишите код

# -1 означает, что последовательность упорядочена по возрастанию
# Если это не так, 'index' меняется в цикле на индекс элемента,
# нарушающего порядок
index = -1

prev = float(input("1-е число = "))
for # Удалите комментарий и допишите код
# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# n = 4
# 1-е число = 2
# 2-е число = 4.6
# 3-е число = 6
# 4-е число = 8.3
# Является
#
# n = 3
# 1-е число = 3
# 2-е число = 3
# 2

