
# Задание task_01_01.
""" Составьте программу, которая запрашивает у пользователя 2 целых числа и выполняет операции:
•	арифметические: +, -, * , / , // , %, **;
•	сравнение: <, <=, >, >=, !=, ==,
выводя на экран результат каждого действия. В случае получение вещественного результата, округлите его до 2-х знаков после запятой (используя функцию round()).
"""
# Выполнил: Фамилия И.О.
# Группа: !!!


a = int(input("a="))
b = # Удалите комментарий и допишите код

print(a + b)
print(# Удалите комментарий и допишите код)
# Удалите комментарий и допишите код для прочих операций

print(a < b)
print(# Удалите комментарий и допишите код)
# Удалите комментарий и допишите код для прочих операций


# --------------
# Пример вывода:
#
# a=2
# b=3
# 5
# -1
# 6
# 0.67
# 0
# 2
# 8
# True
# True
# False
# False
# True
# False
