
# Задание task_03_01_14.
#
# Выполнил: Фамилия И.О.
# Группа: !!!



def split_numbers(!!!):
    """Вернуть 2 списка - отрицательных и неотицательных значений.

    !!!

    Результат:
        - list: отрицательные значения;
        - list: неотицательные значения."""
    # Удалите комментарий и допишите код


print(split_numbers(1, 4, -5, 0, -33))

# --------------
# Пример вывода:
#
# ([-5, -33], [0, 1, 4])
