
# Задание task_02_05.
#
# Выполнил: Фамилия И.О.
# Группа: !!!



x = # Удалите комментарий и допишите код
y = # Удалите комментарий и допишите код

if # Удалите комментарий и допишите код:
    print("1-я четверть")
elif # Удалите комментарий и допишите код:

# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# Введите координату x: 5
# Введите координату y: 7
# 1-я четверть
