
# Задание task_03_01_11.
#
# Выполнил: Фамилия И.О.
# Группа: !!!



def ceasar(text, shift):
    """Вернуть измененную строку 'text' со сдвигом 'shift'.

    Параметры:
        - text (str): строка;
        - shift (int): свдиг.

    Результат:
        str: измененная строка."""
    # Набор кириллических букв
    letters = [chr(i) for i in range(ord('а'), ord('я') + 1)]

    # Удалите комментарий и допишите код


text = # Удалите комментарий и допишите код
shift = # Удалите комментарий и допишите код

encoded = # Удалите комментарий и допишите код
decoded = # Удалите комментарий и допишите код
print("Зашифрованная строка:", encoded)
print("Расшифрованная строка:", decoded)

# --------------
# Пример вывода:
#
# Введите предложение: ПрограММиРОВание С++
# Введите сдвиг: 4
# Зашифрованная строка: УфтзфдРРмФТЖдсмй Х++
# Расшифрованная строка: ПрограММиРОВание С++
